import { Box, Typography } from "@mui/material";
import panel10 from "./Images/panel10.png";

const Paragraf10TextRight = () => {
    return (
        <Box>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>Услуги технического заказчика - это комплекс мероприятий, направленных на обеспечение качественного и своевременного выполнения строительных работ и контроля за их соответствием проектной документации.
                Технический заказчик выступает от имени заказчика (заказчиком может быть государство, компания или частное лицо) и выполняет следующие функции:
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                1. Контроль качества и соответствия работ проектной документации, технических условий и требований законодательства.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                2. Организация процесса строительства, контроль за выполнением графика работ, соблюдением норм и правил техники безопасности, санитарных норм и экологических требований.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                3. Работа с подрядчиками и поставщиками, контроль за качеством используемых материалов и оборудования.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                4. Оформление необходимой документации, в том числе актов выполненных работ, сдачи-приемки объекта и пр.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Технический заказчик контролирует выполнение всех этапов проекта, включая разработку проектной документации, строительные работы, закупку материалов и техники, проведение испытаний и приемку объекта. Технический заказчик также контролирует соответствие работ требованиям технических норм и правил, а также соблюдение сроков и бюджета проекта.
            </Typography>
        </Box>
    )
};

const Paragraf10TextBottom = () => {
    return (
        <Box sx={{paddingTop: '30px'}}>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Наша компания предоставляет услуги технического заказчика оказываемые юридическим лицам и физическим лицам при новом строительстве, реконструкции, перепланировке, переоборудовании зданий, строений, сооружений любого назначения в Москве, Московской области, городах федерального значения.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Компания “Консалтэкспертстрой” обеспечит максимальную защиту интересов заказчика и гарантирут высокое качество выполнения работ.
            </Typography>
        </Box>
    )
};



const Paragraf11TextRight = () => {
    return (
        <Box>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>Услуги технического заказчика - это комплекс мероприятий, направленных на обеспечение качественного и своевременного выполнения строительных работ и контроля за их соответствием проектной документации.
                Технический заказчик выступает от имени заказчика (заказчиком может быть государство, компания или частное лицо) и выполняет следующие функции:
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                1. Контроль качества и соответствия работ проектной документации, технических условий и требований законодательства.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                2. Организация процесса строительства, контроль за выполнением графика работ, соблюдением норм и правил техники безопасности, санитарных норм и экологических требований.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                3. Работа с подрядчиками и поставщиками, контроль за качеством используемых материалов и оборудования.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74', paddingLeft: '10px' }}>
                4. Оформление необходимой документации, в том числе актов выполненных работ, сдачи-приемки объекта и пр.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Технический заказчик контролирует выполнение всех этапов проекта, включая разработку проектной документации, строительные работы, закупку материалов и техники, проведение испытаний и приемку объекта. Технический заказчик также контролирует соответствие работ требованиям технических норм и правил, а также соблюдение сроков и бюджета проекта.
            </Typography>
        </Box>
    )
}

const Paragraf11TextBottom = () => {
    return (
        <Box sx={{paddingTop: '30px'}}>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Наша компания предоставляет услуги технического заказчика оказываемые юридическим лицам и физическим лицам при новом строительстве, реконструкции, перепланировке, переоборудовании зданий, строений, сооружений любого назначения в Москве, Московской области, городах федерального значения.
            </Typography>
            <Typography sx={{ fontStyle: 'italic', fontWeight: '400', fontSize: '17px', textAlign: 'justify', color: '#2B3F74' }}>
                Компания “Консалтэкспертстрой” обеспечит максимальную защиту интересов заказчика и гарантирут высокое качество выполнения работ.
            </Typography>
        </Box>
    )
}





export const InfoText = [
    {
        title: 'УСЛУГИ ТЕХНИЧЕСКОГО ЗАКАЗЧИКА',
        page: 'panel1',
        paragraf: 'paragraf1.0',
        image: panel10,
        textRight: <Paragraf10TextRight />,
        textBottom: <Paragraf10TextBottom />
    },
    {
        title: 'Оформление земельно-правовых отношений',
        page: 'panel1',
        paragraf: 'paragraf1.1',
        image: '',
        textRight: <Paragraf11TextRight />,
        textBottom: 'Услуга оформления земельно-правовых отношений включает в себя юридическую поддержку и помощь в оформлении документов, связанных с правами на земельные участки. Эта услуга может включать получение прав на землю, подготовку договоров аренды, купли-продажи, разрешений на использование земли, разрешений на строительство и других документов. Наши специалисты имеют большой опыт работы в этой области и готовы помочь вам в решении всех вопросов, связанных с оформлением земельных прав. Мы гарантируем точность и своевременное выполнение всех работ, чтобы обеспечить максимальный комфорт и удобство для наших клиентов.'
    },
    {
        title: 'Получение исходно - разрешительной документации на предпроектной стадии',
        page: 'panel1',
        paragraf: 'paragraf1.2',
        image: '',
        textRight: '',
        textBottom: 'Услуга получения исходно-разрешительной документации на предпроектной стадии включает в себя сбор и подготовку необходимых документов для получения разрешений на строительство объекта недвижимости. Это может включать в себя согласование проектной документации с государственными и муниципальными органами, получение разрешений на использование земли, согласование проекта с соседними участками и другие подобные процедуры. Наши специалисты имеют большой опыт работы с получением исходно-разрешительной документации на предпроектной стадии и готовы предоставить всестороннюю юридическую и техническую поддержку в процессе получения разрешительных документов. Мы гарантируем точность и своевременное выполнение всех работ, чтобы обеспечить максимальную эффективность проекта и удобство для наших клиентов.'
    },
    {
        title: 'Согласование проектных документов на стадии разработки «Проектной документации»',
        page: 'panel1',
        paragraf: 'paragraf1.3',
        image: '',
        textRight: '',
        textBottom: ''
    },
    {
        title: 'Согласование рабочей документации',
        page: 'panel1',
        paragraf: 'paragraf1.4',
        image: '',
        textRight: '',
        textBottom: 'Услуга согласования рабочей документации включает в себя проверку и подготовку необходимых документов для получения разрешений на строительство объекта недвижимости на этапе проектирования. Это может включать в себя согласование рабочей документации с государственными и муниципальными органами, получение разрешений на использование земли и других разрешительных документов. Наши специалисты имеют большой опыт работы с согласованием рабочей документации и готовы предоставить всестороннюю юридическую и техническую поддержку в процессе согласования. Мы гарантируем точность и своевременное выполнение всех работ, чтобы обеспечить максимальную эффективность проекта и удобство для наших клиентов.'
    },
    {
        title: 'Сдача-приемка объекта',
        page: 'panel1',
        paragraf: 'paragraf1.5',
        image: '',
        textRight: '',
        textBottom: 'Услуга сдачи-приемки объекта строительства включает в себя проведение комплексной проверки готовности объекта к эксплуатации и сдаче заказчику. Это может включать в себя проверку соответствия построенного объекта проектной документации, выполнение всех необходимых работ по организации внутренних инженерных сетей, электричества, вентиляции, отопления и т.д., а также проверку качества выполненных строительных работ и соответствия заявленным техническим характеристикам. Наши специалисты проводят полное обследование объекта и составляют отчет о готовности к эксплуатации, который представляется заказчику.'
    },
    {
        title: 'Услуги, оказываемые физическим лицам',
        page: 'panel1',
        paragraf: 'paragraf1.6',
        image: '',
        textRight: '',
        textBottom: 'paragraf1.6'
    },
    {
        title: 'Независимая экспертиза сметной документации',
        page: 'panel2',
        paragraf: 'paragraf2.0',
        image: '',
        textRight: '',
        textBottom: 'Независимая экспертиза сметной документации - это процесс оценки сметной документации на соответствие требованиям законодательства и нормам строительной практики. В ходе такой экспертизы, независимые эксперты анализируют составленную смету на соответствие утвержденным сметным нормативам, техническим решениям проектной документации, проводят проверку корректности расчетов и правильности выбора материалов и оборудования. Они также проверяют, соответствует ли смета нормам безопасности, стандартам качества и экологическим нормам. Независимая экспертиза сметной документации является важным инструментом для защиты интересов заказчика и установления прозрачных условий в строительной сфере. После проведения экспертизы, заказчик получает отчет с рекомендациями экспертов, которые помогают ему принять взвешенное решение о принятии, корректировке или отклонении сметной документации. Таким образом, независимая экспертиза сметной документации способствует повышению качества строительных работ, оптимизации расходов, помогает установить незапланированные затраты и обеспечивает максимальную защиту интересов заказчика.'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.0',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.0'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.1',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.1'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.2',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.2'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.3',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.3'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.4',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.4'
    },
    {
        page: 'panel3',
        paragraf: 'paragraf3.5',
        image: '',
        textRight: '',
        textBottom: 'paragraf3.5'
    },
    {
        page: 'panel4',
        paragraf: 'paragraf4.0',
        image: '',
        textRight: '',
        textBottom: 'paragraf4.0'
    },
    {
        page: 'panel5',
        paragraf: 'paragraf5.0',
        image: '',
        textRight: '',
        textBottom: 'paragraf5.0'
    },
    {
        page: 'panel5',
        paragraf: 'paragraf5.1',
        image: '',
        textRight: '',
        textBottom: 'paragraf5.1'
    },
    {
        page: 'panel5',
        paragraf: 'paragraf5.2',
        image: '',
        textRight: '',
        textBottom: 'paragraf5.2'
    },
    {
        page: 'panel5',
        paragraf: 'paragraf5.3',
        image: '',
        textRight: '',
        textBottom: 'paragraf5.3'
    },
    {
        page: 'panel5',
        paragraf: 'paragraf5.4',
        image: '',
        textRight: '',
        textBottom: 'paragraf5.4'
    }
];